In [3]:
import numpy as np
import pandas as pd

In [4]:
dict1 = {
    "name":["Andy","Doe","John","Doe","Doe","Andy"],
    "marks":[23,45,67,89,90,23],
    "city":["delhi","mumbai","pune","delhi","mumbai","delhi"]
}

In [5]:
df = pd.DataFrame(dict1)

In [6]:
df

   name  marks    city
0  Andy     23   delhi
1   Doe     45  mumbai
2  John     67    pune
3   Doe     89   delhi
4   Doe     90  mumbai
5  Andy     23   delhi

In [7]:
df.to_csv('friends.csv')

In [8]:
df.to_csv('friends.csv' , index=False)

In [9]:
df.tail(2)

   name  marks    city
4   Doe     90  mumbai
5  Andy     23   delhi

In [10]:
df.head(2)

   name  marks    city
0  Andy     23   delhi
1   Doe     45  mumbai

In [11]:
df.describe()

           marks
count   6.000000
mean   56.166667
std    30.544503
min    23.000000
25%    28.500000
50%    56.000000
75%    83.500000
max    90.000000

In [12]:
friend = pd.read_csv('friends.csv')

In [13]:
friend

   name  marks    city
0  Andy     23   delhi
1   Doe     45  mumbai
2  John     67    pune
3   Doe     89   delhi
4   Doe     90  mumbai
5  Andy     23   delhi

In [14]:
friend['marks'][0] = 90

C:\Users\AVITA\AppData\Local\Temp\ipykernel_7484\1324749110.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  friend['marks'][0] = 90
C:\Users\AVITA\AppData\Local\Temp\ipykernel_7484\1324749110.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  friend['marks'][0] = 90

In [15]:
friend

   name  marks    city
0  Andy     90   delhi
1   Doe     45  mumbai
2  John     67    pune
3   Doe     89   delhi
4   Doe     90  mumbai
5  Andy     23   delhi

In [16]:
friend.to_csv('friends.csv' , index=False)

In [17]:
friend.index = ['first','second','third','fourth','fifth','sixth']

In [18]:
friend

        name  marks    city
first   Andy     90   delhi
second   Doe     45  mumbai
third   John     67    pune
fourth   Doe     89   delhi
fifth    Doe     90  mumbai
sixth   Andy     23   delhi

In [19]:
ser = pd.Series(np.random.rand(34))

In [20]:
ser

0     0.250704
1     0.591688
2     0.395846
3     0.409838
4     0.526720
5     0.856645
6     0.587857
7     0.749217
8     0.174330
9     0.447802
10    0.888130
11    0.022395
12    0.670688
13    0.010270
14    0.935318
15    0.866067
16    0.555333
17    0.352318
18    0.253414
19    0.110761
20    0.798704
21    0.181153
22    0.846656
23    0.458677
24    0.146823
25    0.090201
26    0.240756
27    0.817106
28    0.256470
29    0.615900
30    0.146717
31    0.488781
32    0.530461
33    0.878716
dtype: float64

In [21]:
newDf = pd.DataFrame(np.random.rand(334 , 5),index=np.range(334))

AttributeError: module 'numpy' has no attribute 'range'

In [ ]:
newDf = pd.DataFrame(np.random.rand(334 , 5),index=np.arange(334))

In [ ]:
newDf

            0         1         2         3         4
0    0.684930  0.359800  0.235529  0.668418  0.845064
1    0.279782  0.257685  0.682862  0.794149  0.356685
2    0.478002  0.293959  0.232841  0.803507  0.511459
3    0.000726  0.136234  0.730731  0.303306  0.043299
4    0.504352  0.121835  0.620625  0.811700  0.295965
..        ...       ...       ...       ...       ...
329  0.542773  0.533268  0.645297  0.681737  0.637628
330  0.286682  0.114765  0.228743  0.207679  0.268087
331  0.383352  0.932572  0.022783  0.194466  0.194871
332  0.616297  0.465434  0.223400  0.814535  0.424078
333  0.779749  0.915808  0.934046  0.021597  0.276714

[334 rows x 5 columns]

In [ ]:
type(newDf)

pandas.core.frame.DataFrame

In [ ]:
newDf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.500666    0.490641    0.503531    0.504227    0.491582
std      0.281530    0.293439    0.283108    0.293000    0.293693
min      0.000726    0.004398    0.003326    0.003736    0.000168
25%      0.257860    0.215795    0.258526    0.251335    0.235504
50%      0.499153    0.491356    0.491972    0.496151    0.499685
75%      0.733343    0.760771    0.758927    0.776166    0.752464
max      0.993573    0.993714    0.996796    0.999001    0.993357

In [ ]:
newDf.head(2)

          0         1         2         3         4
0  0.684930  0.359800  0.235529  0.668418  0.845064
1  0.279782  0.257685  0.682862  0.794149  0.356685

In [ ]:
newDf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [ ]:
newDf.columns

RangeIndex(start=0, stop=5, step=1)

In [ ]:
newDf.to_numpy()

array([[0.68493023, 0.35979975, 0.23552944, 0.66841812, 0.84506385],
       [0.27978193, 0.25768549, 0.68286218, 0.79414909, 0.35668523],
       [0.47800166, 0.29395891, 0.23284109, 0.80350717, 0.51145859],
       ...,
       [0.38335212, 0.93257208, 0.02278336, 0.19446599, 0.19487059],
       [0.61629681, 0.46543423, 0.22339961, 0.81453517, 0.4240778 ],
       [0.77974907, 0.9158078 , 0.93404647, 0.02159703, 0.27671416]])

In [ ]:
newDf[0][0] = 0.232

C:\Users\AVITA\AppData\Local\Temp\ipykernel_2924\864233028.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newDf[0][0] = 0.232

In [ ]:
newDf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.232000,0.279782,0.478002,0.000726,0.504352,0.120061,0.398421,0.865997,0.770409,0.208393,...,0.653335,0.983636,0.641048,0.499854,0.183927,0.542773,0.286682,0.383352,0.616297,0.779749
1,0.359800,0.257685,0.293959,0.136234,0.121835,0.969905,0.450345,0.607770,0.992433,0.374878,...,0.739153,0.092154,0.932295,0.680608,0.307498,0.533268,0.114765,0.932572,0.465434,0.915808
2,0.235529,0.682862,0.232841,0.730731,0.620625,0.849945,0.403204,0.759166,0.546509,0.528247,...,0.275618,0.345953,0.912385,0.224208,0.671784,0.645297,0.228743,0.022783,0.223400,0.934046
3,0.668418,0.794149,0.803507,0.303306,0.811700,0.175127,0.962149,0.832591,0.256286,0.393723,...,0.977568,0.477246,0.468328,0.687686,0.042640,0.681737,0.207679,0.194466,0.814535,0.021597
4,0.845064,0.356685,0.511459,0.043299,0.295965,0.130313,0.130969,0.730907,0.921793,0.883894,...,0.260334,0.309349,0.660856,0.082785,0.120251,0.637628,0.268087,0.194871,0.424078,0.276714

In [ ]:
newDf.head()

          0         1         2         3         4
0  0.232000  0.359800  0.235529  0.668418  0.845064
1  0.279782  0.257685  0.682862  0.794149  0.356685
2  0.478002  0.293959  0.232841  0.803507  0.511459
3  0.000726  0.136234  0.730731  0.303306  0.043299
4  0.504352  0.121835  0.620625  0.811700  0.295965

In [ ]:
newDf.sort_index(axis=0 , ascending=False)

            0         1         2         3         4
333  0.779749  0.915808  0.934046  0.021597  0.276714
332  0.616297  0.465434  0.223400  0.814535  0.424078
331  0.383352  0.932572  0.022783  0.194466  0.194871
330  0.286682  0.114765  0.228743  0.207679  0.268087
329  0.542773  0.533268  0.645297  0.681737  0.637628
..        ...       ...       ...       ...       ...
4    0.504352  0.121835  0.620625  0.811700  0.295965
3    0.000726  0.136234  0.730731  0.303306  0.043299
2    0.478002  0.293959  0.232841  0.803507  0.511459
1    0.279782  0.257685  0.682862  0.794149  0.356685
0    0.232000  0.359800  0.235529  0.668418  0.845064

[334 rows x 5 columns]

In [ ]:
newDf.head()

          0         1         2         3         4
0  0.232000  0.359800  0.235529  0.668418  0.845064
1  0.279782  0.257685  0.682862  0.794149  0.356685
2  0.478002  0.293959  0.232841  0.803507  0.511459
3  0.000726  0.136234  0.730731  0.303306  0.043299
4  0.504352  0.121835  0.620625  0.811700  0.295965

In [ ]:
newDf[0]

0      0.232000
1      0.279782
2      0.478002
3      0.000726
4      0.504352
         ...
329    0.542773
330    0.286682
331    0.383352
332    0.616297
333    0.779749
Name: 0, Length: 334, dtype: float64

In [ ]:
type(newDf[0])

pandas.core.series.Series

In [ ]:
newDf2 = newDf.copy()

In [ ]:
newDf

            0         1         2         3         4
0    0.232000  0.359800  0.235529  0.668418  0.845064
1    0.279782  0.257685  0.682862  0.794149  0.356685
2    0.478002  0.293959  0.232841  0.803507  0.511459
3    0.000726  0.136234  0.730731  0.303306  0.043299
4    0.504352  0.121835  0.620625  0.811700  0.295965
..        ...       ...       ...       ...       ...
329  0.542773  0.533268  0.645297  0.681737  0.637628
330  0.286682  0.114765  0.228743  0.207679  0.268087
331  0.383352  0.932572  0.022783  0.194466  0.194871
332  0.616297  0.465434  0.223400  0.814535  0.424078
333  0.779749  0.915808  0.934046  0.021597  0.276714

[334 rows x 5 columns]

In [ ]:
newDf2

            0         1         2         3         4
0    0.232000  0.359800  0.235529  0.668418  0.845064
1    0.279782  0.257685  0.682862  0.794149  0.356685
2    0.478002  0.293959  0.232841  0.803507  0.511459
3    0.000726  0.136234  0.730731  0.303306  0.043299
4    0.504352  0.121835  0.620625  0.811700  0.295965
..        ...       ...       ...       ...       ...
329  0.542773  0.533268  0.645297  0.681737  0.637628
330  0.286682  0.114765  0.228743  0.207679  0.268087
331  0.383352  0.932572  0.022783  0.194466  0.194871
332  0.616297  0.465434  0.223400  0.814535  0.424078
333  0.779749  0.915808  0.934046  0.021597  0.276714

[334 rows x 5 columns]

In [ ]:
newDf.loc[0,0]

0.232

In [ ]:
newDf.drop(0)

NameError: name 'newDf' is not defined

In [23]:
newDf.drop(0 , axis=1)

NameError: name 'newDf' is not defined

In [24]:
newDf

NameError: name 'newDf' is not defined

In [25]:
newDf = newDf.drop(0)

NameError: name 'newDf' is not defined

In [26]:
newDf = pd.DataFrame(np.random.rand(334 , 5),index=np.arange(334))

In [27]:
newDf

            0         1         2         3         4
0    0.063880  0.404692  0.991819  0.898517  0.235144
1    0.724268  0.125062  0.844521  0.992746  0.185935
2    0.691219  0.281136  0.075026  0.481114  0.067432
3    0.611351  0.839140  0.488233  0.328451  0.060580
4    0.307737  0.958912  0.386793  0.088254  0.894448
..        ...       ...       ...       ...       ...
329  0.671522  0.469313  0.566035  0.375923  0.779957
330  0.521661  0.953267  0.615395  0.749395  0.711449
331  0.111959  0.561370  0.499511  0.755927  0.603101
332  0.123076  0.269470  0.131846  0.772138  0.540729
333  0.711330  0.986598  0.259705  0.601954  0.122363

[334 rows x 5 columns]

In [29]:
newDf.loc[newDf[0] >0.3]

            0         1         2         3         4
1    0.724268  0.125062  0.844521  0.992746  0.185935
2    0.691219  0.281136  0.075026  0.481114  0.067432
3    0.611351  0.839140  0.488233  0.328451  0.060580
4    0.307737  0.958912  0.386793  0.088254  0.894448
8    0.689428  0.682974  0.828599  0.952564  0.628209
..        ...       ...       ...       ...       ...
325  0.458330  0.001070  0.755943  0.187829  0.454294
328  0.330173  0.722620  0.425380  0.090078  0.328507
329  0.671522  0.469313  0.566035  0.375923  0.779957
330  0.521661  0.953267  0.615395  0.749395  0.711449
333  0.711330  0.986598  0.259705  0.601954  0.122363

[240 rows x 5 columns]

In [30]:
newDf.iloc[0,4]

0.2351435005336603

In [32]:
newDf.iloc[[0,1] , [0,0]]

          0         0
0  0.063880  0.063880
1  0.724268  0.724268

In [33]:
newDf.head(3)

          0         1         2         3         4
0  0.063880  0.404692  0.991819  0.898517  0.235144
1  0.724268  0.125062  0.844521  0.992746  0.185935
2  0.691219  0.281136  0.075026  0.481114  0.067432

In [34]:
newDf[1].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: 1, Length: 334, dtype: bool

In [35]:
newDf[1] = None